{
  "insertWhiteboard": "Insert whiteboard",
  "editWhiteboard": "Edit whiteboard",
  "editShortcut": "Edit selected whiteboard",
  "errors": {
    "noFileID": "File ID missing - couldn't open file.",
    "notAWhiteboard": "You must select a whiteboard, not a regular image. <a href='https://s.massive.box/jsdraw-plugin-instructions'>Usage instructions</a>",
    "syncIDNotFound": "Couldn't find SyncID in document for drawing, make sure you're trying to edit a whiteboard that is included in at least a note.",
    "createUnknown": "Unknown error while creating editor, please try again.",
    "invalidBackgroundColor": "Invalid background color! Please enter an HEX color, like #000000 (black) or #FFFFFF (white). The old background color will be used.",
    "multipleSyncIDs": "Multiple syncIDs found in documents. Remove the drawings that don't exist from your documents.\n Sync conflict copies can cause this error, so make sure to delete them.\nFile IDs (the part you can change in the Rename menu) must be unique across all documents.\n<a href='https://git.massive.box/massivebox/siyuan-jsdraw-plugin/wiki/Errors-and-Fixes#multiple-syncids-found'>Full explanation</a>",
    "unchangedProtyle": "Make sure the image you're trying to edit still exists in your documents.",
    "saveGeneric": "Error saving! The current drawing has been copied to your clipboard. You may need to create a new drawing and paste it there.",
    "mustSelect": "Select a whiteboard in your document by left-clicking it, then use this icon/shortcut to open the editor directly.  <a href='https://s.massive.box/jsdraw-plugin-instructions'>Usage instructions</a>"
  },
  "whiteboard": "Whiteboard",
  "settings": {
    "name": "js-draw Plugin Settings",
    "suggestedColors":{
      "white": "White",
      "black": "Black",
      "transparent": "Transparent",
      "custom": "Custom",
      "darkBlue": "Dark Blue",
      "darkGray": "Dark Gray"
    },
    "grid": {
      "title": "Enable grid by default",
      "description": "Enable to automatically turn on the grid on new whiteboards."
    },
    "backgroundDropdown":{
      "title": "Background color",
      "description": "Default background color for new whiteboards."
    },
    "background": {
      "title": "Custom background",
      "description": "Hexadecimal code of the custom background color for new whiteboards.<br /><b>This setting is only applied if \"Background Color\" is set to \"Custom\"!</b>"
    },
    "dialogOnDesktop": {
      "title": "Open editor as dialog on desktop",
      "description": "Dialog mode provides a larger drawing area, but it's not as handy to use as tabs (default).<br />The editor will always open as a dialog on mobile."
    },
    "analytics": {
      "title": "Analytics",
      "description": "Enable to send anonymous usage data to the developer. <a href='https://s.massive.box/jsdraw-plugin-privacy'>Privacy Policy</a>"
    },
    "restorePosition": {
      "title": "Remember editor position",
      "description": "When enabled, the editor will remember the zoom factor and position, and it will restore them the next time you open the same whiteboard."
    }
  }
}